#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=38eca867-7153-4094-903a-790f17e6cd37]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.1.101" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-09-13 11:47:18 +0000 UTC" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "38eca867-7153-4094-903a-790f17e6cd37" -> (known after apply)
      ~ image_name          = "ubuntu-22.04-amd64-raw" -> (known after apply)
        name                = "cloud-info"
      ~ power_state         = "shutoff" -> "active"
      + region              = (known after apply)
      ~ security_groups     = [
          + "motley",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ updated             = "2024-09-17 10:47:16 +0000 UTC" -> (known after apply)
      ~ user_data           = "79b0063733db832b791f0197dc36d327e7f072b4" -> "6254d4d80c1d7b444f83997dfd4fadcb1d234a50" # forces replacement
        # (4 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.101" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:a9:6c:97" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_networking_secgroup_rule_v2.motley-8080 will be created
  + resource "openstack_networking_secgroup_rule_v2" "motley-8080" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 8080
      + port_range_min    = 8080
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_v2.motley will be created
  + resource "openstack_networking_secgroup_v2" "motley" {
      + all_tags             = (known after apply)
      + delete_default_rules = true
      + description          = "Open ports for motley-cue"
      + id                   = (known after apply)
      + name                 = "motley"
      + region               = (known after apply)
      + tenant_id            = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ instance-id = "38eca867-7153-4094-903a-790f17e6cd37" -> (known after apply)

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on backend.tf line 10, in provider "openstack":
  10: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sebastian-luna-valero, Action: `pull_request`*